In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#ignorar warnings

import warnings
warnings.filterwarnings('ignore')

In [91]:
data = pd.read_csv("data2.csv")

In [92]:
data.shape

(2200, 9)

In [93]:
data.head()

    ID Nombre  Edad  Puntaje    Ciudad Genero  Altura   Peso  Ingresos
0  514   Juan  63.0       77  Ciudad D      M   196.0  168.0     150.0
1   76   Juan  63.0       71  Ciudad A      F   187.0  150.0     186.0
2  548    Ana  19.0       99  Ciudad A      F   199.0  163.0     158.0
3   48  María  27.0       93  Ciudad A      F   164.0  177.0     151.0
4  681   Luis   NaN       86  Ciudad C      M   164.0    NaN       NaN

In [94]:
data.tail()

       ID Nombre  Edad  Puntaje    Ciudad Genero  Altura   Peso  Ingresos
2195  888  María  64.0       59  Ciudad A      M   171.0    NaN     183.0
2196   68   Luis  56.0       72  Ciudad A      F   187.0    NaN     193.0
2197  559   Juan  40.0       83  Ciudad B      F   153.0  165.0     162.0
2198  816   Luis  41.0       82  Ciudad E      M     NaN  153.0       NaN
2199  983   Luis  49.0       67  Ciudad D      F     NaN  155.0     161.0

In [95]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ID        2200 non-null   int64
 1   Nombre    2200 non-null   object
 2   Edad      1753 non-null   float64
 3   Puntaje   2200 non-null   int64
 4   Ciudad    2200 non-null   object
 5   Genero    2200 non-null   object
 6   Altura    1751 non-null   float64
 7   Peso      1740 non-null   float64
 8   Ingresos  1747 non-null   float64
dtypes: float64(4), int64(2), object(3)
memory usage: 154.8+ KB

In [96]:
data.duplicated().sum()

200

In [97]:
data.drop_duplicates(inplace=True)

In [98]:
data.duplicated().sum()

0

In [99]:
data.nunique()

ID          1000
Nombre         5
Edad          48
Puntaje       51
Ciudad         5
Genero         2
Altura        51
Peso          51
Ingresos      51
dtype: int64

In [100]:
data.isnull().sum()

ID            0
Nombre        0
Edad        409
Puntaje       0
Ciudad        0
Genero        0
Altura      417
Peso        416
Ingresos    419
dtype: int64

In [101]:
(data.isnull().sum()/(len(data)))*100

ID           0.00
Nombre       0.00
Edad        20.45
Puntaje      0.00
Ciudad       0.00
Genero       0.00
Altura      20.85
Peso        20.80
Ingresos    20.95
dtype: float64

In [102]:
data["Peso"] = data["Peso"] * 0.453592

In [103]:
genero_moda_altura = data.groupby("Genero")["Altura"].apply(lambda x:x.mode().iloc[0])

In [104]:
ingresos_moda_edad

Genero
F    177.0
M    157.0
Name: Altura, dtype: float64

In [105]:
data["Altura"].fillna(data["Genero"].map(genero_moda_altura),inplace=True)

In [106]:
def calcular_peso_imc(altura,genero):
    if genero == "M":
        return 23 * ((altura/100)**2)
    else:
        return 21 * ((altura/100)**2)

In [107]:
data["Genero"]= data["Genero"].astype(str)

In [108]:
data["Peso"].fillna(data.apply(lambda row: calcular_peso_imc(row["Altura"],row["Genero"]),axis=1),inplace = True)

In [109]:
data

       ID Nombre  Edad  Puntaje    Ciudad Genero  Altura       Peso  Ingresos
0     514   Juan  63.0       77  Ciudad D      M   196.0  76.203456     150.0
1      76   Juan  63.0       71  Ciudad A      F   187.0  68.038800     186.0
2     548    Ana  19.0       99  Ciudad A      F   199.0  73.935496     158.0
3      48  María  27.0       93  Ciudad A      F   164.0  80.285784     151.0
4     681   Luis   NaN       86  Ciudad C      M   164.0  61.860800       NaN
...   ...    ...   ...      ...       ...    ...     ...        ...       ...
2195  888  María  64.0       59  Ciudad A      M   171.0  67.254300     183.0
2196   68   Luis  56.0       72  Ciudad A      F   187.0  73.434900     193.0
2197  559   Juan  40.0       83  Ciudad B      F   153.0  74.842680     162.0
2198  816   Luis  41.0       82  Ciudad E      M   157.0  69.399576       NaN
2199  983   Luis  49.0       67  Ciudad D      F   177.0  70.306760     161.0

[2000 rows x 9 columns]